{
  "title": "About ImmutableType",
  "subtitle": "Building the infrastructure for trusted, community-owned journalism on the blockchain",
  "sections": [
    {
      "heading": "What ImmutableType Is",
      "content": "ImmutableType is a decentralized platform that enables journalists and readers to publish, fund, and preserve journalism on the Flow blockchain. The platform combines verified digital identity with permanent on-chain publishing, allowing journalists to maintain ownership of their work while communities directly support the news that matters to them. Built on Flow EVM Mainnet, ImmutableType creates a tiered verification system where users progress from basic profiles to fully verified identities, ensuring accountability while preserving the permanent record of published work. Community members holding 100 or more BUFFAFLOW tokens receive free platform access, aligning incentives between journalists, readers, and the technology itself."
    },
    {
      "heading": "How It Will Work",
      "content": "ImmutableType's core business will be the News Launchpad, where local journalists and artists propose stories, set funding goals, and receive direct community support. The platform will use geographic verification to ensure only local creators can launch article proposals in their region, but anyone can fund stories they care about. Here's the crucial part: when non-local supporters fund a story, the monetization benefits will flow back to the local community that launched it. This creates economic incentives for local journalism while allowing broader audiences to support important stories wherever they happen. Users start by creating verified profiles through a three-tier system on Flow blockchain—basic wallet connection, social verification through Farcaster, or full identity verification through Crossmint KYC. Geographic verification will tie journalists and artists to their communities, ensuring authentic local voices control local narratives. Once verified, anyone can browse proposed stories, fund investigations they believe matter, and track progress as journalists deliver on their commitments. The platform currently includes bookmark collection and NFT minting features for preserving important journalism as we build toward the full Launchpad vision. Desktop Web3 wallet integration and a Chrome extension provide seamless access today. Each funded story will create transparent on-chain records showing exactly how community resources support journalism, building trust through radical transparency."
    },
    {
      "heading": "Why Blockchain for Journalism",
      "content": "Traditional media faces an existential trust crisis. Centralized publishers can edit or delete articles, journalists lose attribution when outlets close, and advertising models incentivize engagement over accuracy. Blockchain solves this by making published work immutable and permanently attributable to its author. When journalism lives on-chain, it cannot be altered, censored, or erased—creating perfect accountability. This technology enables direct community funding without intermediaries, returns ownership to journalists instead of corporations, and builds verifiable records of sources and contributors. ImmutableType applies these principles to restore trust between communities and the journalists who serve them, starting at the local level where relationships matter most."
    },
    {
      "heading": "Current Status",
      "content": "ImmutableType launched Phase 5 to production in October 2025, with core platform features deployed to Flow EVM Mainnet (Chain ID 747). The ProfileNFT smart contract manages three-tier verification, while the BookmarkNFT contract enables permanent on-chain preservation of journalism. The desktop Web3 application runs at app.immutabletype.com, with BUFFAFLOW token integration providing qualification-based access. Users can currently create verified profiles, import bookmarks via Chrome extension, and mint bookmarks as NFTs. The platform is preparing for expanded deployment including Farcaster integration and multi-city community building, with Miami serving as the initial pilot market for community-funded local journalism."
    },
    {
      "heading": "For Journalists",
      "content": "Traditional newsrooms are consolidating or closing, leaving talented journalists without platforms or proper attribution for their work. ImmutableType offers an alternative: publish your journalism on-chain where it becomes permanently yours, immutable and always attributed to you regardless of what happens to any publisher. The verification system establishes your credibility through progressive tiers—from basic wallet connection to full identity verification—without requiring approval from editorial gatekeepers. Once verified, you can publish articles that live permanently on the blockchain, receive direct funding from community members who value your work, and build a transparent record of your journalism that no corporation can erase or claim. This isn't about replacing traditional outlets entirely; it's about giving you ownership, control, and direct relationships with the communities you serve."
    },
    {
      "heading": "For Readers",
      "content": "Reading journalism is passive; preserving it makes you part of the story. When you bookmark articles on ImmutableType and mint them as NFTs, you're creating a permanent archive of journalism you believe matters—stories that might otherwise disappear when websites redesign, outlets close, or articles get quietly edited. Your support flows directly to journalists rather than being filtered through corporate media structures and advertising middlemen. As a community member, you help decide which stories deserve funding and preservation, shifting editorial power from boardrooms to neighborhoods. BUFFAFLOW token holders with 100 or more tokens receive free platform access, aligning your participation with the community's growth. This transforms news consumption into active stewardship, building a permanent, uncensored record of the journalism your community values most."
    },
    {
      "heading": "Why This Matters Now",
      "content": "The free press faces an existential threat. Seventy-two million Americans live in news deserts with no local source of information, while governments worldwide pass laws requiring platforms to moderate speech—direct attacks on the First Amendment disguised as safety measures. The EU, Canada, and California actively impose content moderation requirements that amount to censorship by bureaucracy. This is Orwell come to life, and the risk isn't that bad actors will win—it's that citizens will fail to care until it's too late. Blockchain offers the only censorship-resistant infrastructure for journalism. When speech controls tighten further, peer-to-peer communication on immutable public ledgers will be the last free communication lines standing. ImmutableType isn't preparing for a hypothetical future threat. We're responding to the present reality where deplatforming, content moderation mandates, and centralized control over information flow are normalized. The individual publisher and the communities they serve both face existential risk. There is no place for censorship among free people. We cannot give up an inch."
    },
    {
      "heading": "The Vision: 20,000 Towns",
      "content": "Success means 20,000 cities and towns across America having their own source of trusted local information. We want to see Little League final scores published again. Notices of local births, weddings, and obituaries. Minutes from town hall meetings. Local crime data. Whimsical stories about the community joker dancing at a fundraiser. The journalism that makes neighbors recognize each other as aligned instead of adversaries. This isn't nostalgia for a bygone era—it's recognition that local information infrastructure collapsed and took community cohesion with it. National news outlets cannot and will not cover the pothole on your street, the funding crisis at your fire department, or the zoning decision affecting your neighborhood. Those stories matter more to your daily life than any national narrative, yet 72 million Americans have no one covering them. ImmutableType rebuilds local journalism economics by removing intermediaries and letting communities directly fund the information they need. When readers own the journalism through bookmarks minted as NFTs and journalists own their work through on-chain attribution, the value stays local where it belongs."
    },
    {
      "heading": "Why Local Changes Everything",
      "content": "All that matters is local matters. National outlets attempting to disrupt local journalism miss the fundamental point: local journalism disrupts national media simply by existing. Filling potholes, funding fire departments, deciding school board policies—these local priorities don't require national desk intervention. In fact, national narratives often distort local decision-making by importing controversies that don't reflect community priorities. Local news hubs resist narrative capture from perverse political elements precisely because they're accountable to neighbors, not distant shareholders or ideological boards. When journalism economics are localized, editorial priorities naturally align with community needs rather than engagement metrics or advertiser demands. A journalist funded directly by 200 local readers serves those readers. A journalist paid by a national media conglomerate serves that conglomerate's interests, even when covering local stories. The structure determines the outcome. ImmutableType's city hub model—launching first in Miami, then replicating to additional markets—proves that decentralized infrastructure can support neighborhood-level journalism that larger outlets cannot sustain economically. Each city hub operates with local governance, local funding, and local accountability while sharing core blockchain infrastructure."
    },
    {
      "heading": "Why We're Building This",
      "content": "I founded ImmutableType because I've watched information systems break in real time, and now AI threatens to make it exponentially worse. I was an SEO professional at Overstock.com in the 2000s when search engines and social media emerged, and I immediately saw what was coming: content farms would win, journalism would lose, and nobody was prepared. Now generative AI can flood the zone with synthetic content at scale, making proof of human authorship the existential question for information. My job was information and marketplace networks, so the solution was obvious—remove the intermediaries, let markets drive information priorities, use blockchain for transparency and proof of human source. I was born in 1971, grew up with Paul Harvey on the radio and Sunday mornings with the newspaper comics. I learned to type on a typewriter. One day I was reading a newspaper in a Seattle Barnes & Noble and learned about Amazon, which inspired me to buy a book about HTML and learn to build websites. Publishing my first website was one of the most inspiring experiences of my life. I got into Bitcoin in 2012. I joined Overstock.com when we all fit in one room and the company was still under one hundred million dollars in sales—I left as VP of Marketing when it hit $2 billion. I've been a 2x CMO with two exits including the biggest online live auction marketplace doing $5 billion in GMV. I've seen every major media disruption from Pong to NFTs, and I know when disruption is creative versus just iterative. Journalism is facing creative destruction right now. I was born pro-freedom and pro-free speech, and I've watched both come under attack like never before. ImmutableType exists because trust in media can be reversed. Prove the source, increase local ownership, inspire communities to talk to each other again. That's the work."
    }
  ]
}