{
    "title": "ImmutableType Development Roadmap",
    "subtitle": "Building decentralized journalism infrastructure in phases",
    "sections": [
      {
        "heading": "Our Approach",
        "content": "ImmutableType follows an incremental deployment strategy, launching functional components to production as they're completed rather than waiting for a monolithic release. Each phase builds on previous infrastructure, allowing real users to test systems while we continue development. Since founding in 2021, we've progressed from concept through multiple development cycles, validation through competitive programs, a groundbreaking NFT launch, and deployment to Flow EVM Mainnet. This roadmap reflects our journey from incubator graduate to production platform, including completed milestones and realistic timelines for upcoming features. Dates represent target quarters and may adjust based on technical requirements, security audits, and user feedback. Our priority is building reliable, secure infrastructure over meeting arbitrary deadlines."
      },
      {
        "heading": "Phase 1-4: Foundation & Validation (2021-2024)",
        "content": "ImmutableType was founded in 2021 in response to emerging challenges in media trust, AI-generated content, and the deteriorating economics of independent journalism. The project spent its early years refining the vision through research, prototyping, and community building. In February 2024, ImmutableType entered the Built in Miami Startup Program, Florida's largest startup incubator operated by Venture Miami. The rigorous 18-week program provided systematic curriculum, local mentorship, and community engagement alongside over 200 South Florida entrepreneurs. The program culminated in June 2024 with Demo Day and a commendation from Mayor Francis Suarez, validating the platform's approach to decentralized journalism. Following the incubator, ImmutableType entered the Flow GrantDAO competition in July 2024, securing a third-place finish among projects building consumer Web3 applications. This prestigious recognition from the Flow Foundation included funding and positioned ImmutableType within Flow's ecosystem of major brands like NBA, NFL, and Disney. These validation milestones provided resources and credibility to advance from concept to production deployment."
      },
      {
        "heading": "Phase 5: MoonBuffaFLOW Collection (July 2025)",
        "content": "Phase 5 marked a breakthrough moment with the July 2025 launch of the MoonBuffaFLOW NFT collection, demonstrating both technical innovation and community demand for ImmutableType's vision. The collection comprised 156 NFTs bonded to 15,600,000 BUFFAFLOW tokens using the novel ERC-404 standard on Flow EVM, creating a hybrid token that combines NFT ownership with fungible token utility. The collection sold out within hours and rapidly achieved a 50,000 FLOW market cap, becoming the largest launch in Flowfun.xyz history. This success validated ImmutableType's tokenomics model and established BUFFAFLOW as a key utility token for the platform ecosystem. MoonBuffaFLOW holders gained early access to platform features, governance participation rights, and qualification benefits that would shape ImmutableType's development. The ERC-404 implementation showcased technical sophistication, bonding liquid tokens to unique NFTs in a way that preserved both collectibility and tradability. Beyond fundraising, the collection built a committed community of early supporters who understood the vision of decentralized journalism and demonstrated willingness to financially back the platform's development. The MoonBuffaFLOW launch provided runway for intensive development leading to mainnet deployment."
      },
      {
        "heading": "Phase 6: Core Infrastructure (Completed - October 2025)",
        "content": "Phase 6 deployed ImmutableType's core platform to production on Flow EVM Mainnet. The ProfileNFT smart contract implements a three-tier verification system allowing users to progress from basic wallet connection through social verification to full identity verification. The BookmarkNFT contract enables users to collect important journalism and mint bookmarks as permanent on-chain records. Desktop Web3 integration provides seamless MetaMask wallet connectivity, while a Chrome extension allows users to import existing bookmarks directly into the platform. BUFFAFLOW token integration qualifies users holding 100 or more tokens for free platform access, directly rewarding MoonBuffaFLOW collection supporters and early community members. The production application runs at app.immutabletype.com with all smart contracts deployed to Flow's mainnet environment. Users can currently create verified profiles, manage bookmark collections across three tabs, and mint bookmarks as NFTs. This phase established the technical foundation and proved the core concepts of decentralized identity and permanent content preservation. Deployment coincided with participation in the Forte Hacks competition, demonstrating working mainnet features to the broader Flow developer community while building on the momentum from MoonBuffaFLOW's successful launch."
      },
      {
        "heading": "Phase 7: News Launchpad (November 2025)",
        "content": "Phase 7 delivers the News Launchpad, launching November 15, 2025 as ImmutableType's first community funding mechanism. The Launchpad allows journalists to propose stories, set funding goals, and receive direct support from community members interested in specific coverage. Readers can browse proposed stories, fund investigations they care about, and track progress as journalists work on funded pieces. Each campaign creates transparent on-chain funding records showing exactly how community resources support journalism. The Launchpad shifts editorial power from corporate media to community priorities, enabling local stories that traditional outlets ignore or cannot afford to cover. MoonBuffaFLOW holders receive enhanced Launchpad features including early access to story proposals, governance participation in featured story selection, and reduced platform fees. Funded journalists maintain full ownership of their work while meeting commitments to their supporters. This phase introduces the direct funding model central to ImmutableType's mission, proving that communities will financially support journalism addressing their interests. The Launchpad coincides with the conclusion of the Forte Hacks competition November 1, showcasing ImmutableType's progression from infrastructure platform to functional journalism marketplace."
      },
      {
        "heading": "Phase 8: Miami Local News Hub (December 2025)",
        "content": "Phase 8 launches the Miami Local News Hub in December 2025, establishing ImmutableType's first geographic community and proving the model for city-specific journalism networks. The Hub aggregates Miami-focused stories from verified local journalists, creates discovery mechanisms for Miami news, and builds a dedicated community of South Florida readers and writers. Miami serves as the pilot market given ImmutableType's roots in the city's startup ecosystem, strong MoonBuffaFLOW community presence in South Florida, and existing relationships with local journalists. The Hub demonstrates how decentralized infrastructure can support neighborhood-level journalism that larger outlets cannot sustain economically. Features include Miami-specific story discovery, local journalist profiles, geographic tagging for stories and bookmarks, and community forums for Miami readers. MoonBuffaFLOW holders in Miami receive priority verification, featured placement for Miami story proposals, and governance participation in Hub development decisions. This concentrated launch allows intensive testing of community dynamics, funding patterns, and journalist onboarding workflows before expanding to additional cities. Success metrics include active Miami journalists publishing regularly, consistent community funding of local stories, and reader engagement with Miami-specific content."
      },
      {
        "heading": "Phase 9: Social & Identity Verification (Q4 2025)",
        "content": "Phase 9 strengthens the platform's verification infrastructure with Farcaster integration for Tier 1 social verification and Crossmint KYC for Tier 2 identity verification. Farcaster integration allows users to connect their Farcaster identities to ImmutableType profiles, providing stronger identity signals than wallet-only verification while maintaining decentralization principles. The Farcaster connection enables social graph features, showing connections between verified users and building trust networks within the journalism community. Crossmint's KYC integration handles government-issued identity verification for users requiring the highest credibility level, particularly professional journalists, public officials, and institutional accounts. The implementation follows privacy-preserving principles, storing minimal data on-chain while maintaining verification integrity. Enhanced profile features will display verification badges, social connections, activity history, and MoonBuffaFLOW holder status. This dual verification approach creates a spectrum of trust from anonymous participation through proven identity, allowing users to choose their comfort level while readers understand the verification strength behind each journalist and story. The verification infrastructure supports the growing News Launchpad and prepares for expanded article publishing features."
      },
      {
        "heading": "Phase 10: Article Publishing (Q4 2025)",
        "content": "Phase 10 expands beyond story funding to full article publishing, enabling verified journalists to write, format, and publish articles directly to the blockchain. The publishing interface will support rich text formatting, images, and multimedia while maintaining content permanence and attribution. Each published article becomes an on-chain artifact permanently linked to its author's verified identity, ensuring work remains attributed regardless of what happens to any external platform or publisher. Journalist profiles will expand to showcase published work, verification status, community support history, and article performance. The article publishing system will include version control showing any updates to stories while maintaining the original published text, providing transparency about editorial changes. MoonBuffaFLOW holders will receive publishing fee discounts, priority placement in discovery feeds, and enhanced monetization options for their published work. Storage solutions will balance on-chain permanence with practical file size constraints, likely using distributed storage systems for content with on-chain pointers and metadata. This phase transforms ImmutableType from a story funding platform into a complete publishing environment where journalists own and control their work permanently."
      },
      {
        "heading": "Looking Forward",
        "content": "Beyond Q4 2025, ImmutableType's roadmap includes community governance mechanisms where BUFFAFLOW token holders participate in platform decisions including featured content, verification standards, and ecosystem development priorities. MoonBuffaFLOW collection holders will receive amplified governance weight, recognizing their early support and alignment with the platform's long-term vision. Multi-city expansion will replicate the Miami Hub model in additional markets, each building local journalist networks and reader communities. Target cities include those with strong local journalism traditions, underserved communities lacking local news, and cities with existing Web3 or crypto-native populations. Development priorities include cross-chain interoperability, collaborative journalism tools connecting verified sources with verified journalists, and international expansion beyond U.S. markets. Research areas include zero-knowledge proofs for source protection, decentralized content moderation, and cryptographic tools for investigative journalism. The MoonBuffaFLOW collection will continue evolving as a cornerstone of platform utility, with additional benefits and derivative collections as the ecosystem matures. The vision remains consistent with our founding principles: restore trust in journalism through blockchain transparency, enable direct community funding of important stories, and ensure journalists maintain ownership and attribution of their work permanently."
      }
    ]
  }